# Pandas Week 14 - Joshua Lewi (2473018)

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.3
1.18.1

### 53. Membuat kategori baru menurut threshold (ambang batas)

In [3]:
d = {'hobi':['jogging', 'mancing', 'renang',
             'mancing', 'mancing', 'baca', 
             'baca', 'mancing', 'fotografi',
             'mancing', 'camping']}

df = pd.DataFrame(d)
df

         hobi
0     jogging
1     mancing
2      renang
3     mancing
4     mancing
5        baca
6        baca
7     mancing
8   fotografi
9     mancing
10    camping

In [4]:
df['hobi'].value_counts()

mancing      5
baca         2
fotografi    1
jogging      1
renang       1
camping      1
Name: hobi, dtype: int64

In [5]:
persentase = df['hobi'].value_counts(normalize=True)
persentase

mancing      0.454545
baca         0.181818
fotografi    0.090909
jogging      0.090909
renang       0.090909
camping      0.090909
Name: hobi, dtype: float64

In [6]:
threshold = 0.1
hobi_lain = persentase[persentase < threshold].index
hobi_lain

Index(['fotografi', 'jogging', 'renang', 'camping'], dtype='object')

In [7]:
df['hobi'] = df['hobi'].replace(hobi_lain, 'lainnya')
df

       hobi
0   lainnya
1   mancing
2   lainnya
3   mancing
4   mancing
5      baca
6      baca
7   mancing
8   lainnya
9   mancing
10  lainnya

In [9]:
df['hobi'].value_counts(normalize=True) 
#Model/Studi kasus ini sering ditemui dalam data science. Proporsi kecil, gabungkan menjadi besar.

mancing    0.454545
lainnya    0.363636
baca       0.181818
Name: hobi, dtype: float64

### 54. Menyimpan data frame sebagai file CSV

In [10]:
data = {'nama': ['bayu', 'indra', 'devi', 'agni'],
        'jenis_kelamin': ['L', 'L', 'P', 'L'],
        'usia': [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

In [11]:
df.to_csv('data_peserta.csv')

In [14]:
# df = pd.read_csv('data_peserta.csv')
df = pd.read_csv('data_peserta.csv', index_col=0)

df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

In [15]:
#Ngebuat data csv tanpa index
df.to_csv('data_peserta.csv', index=False)
df = pd.read_csv('data_peserta.csv')
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

### 55. Menghitung jumlah baris menurut kriteria tertentu

In [16]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns=cols)
df

   A  B  C  D  E
0  1  3  4  6  3
1  2  7  6  5  8
2  9  5  2  6  1
3  4  1  2  4  9
4  3  8  8  2  4
5  4  9  9  3  4
6  3  5  3  5  3
7  3  3  2  8  3
8  5  4  2  5  6
9  8  5  8  7  1

In [20]:
#Menghitung jumlah baris menurut kriteria tertentu
(df['A'] < 5).sum()

7

In [21]:
#Proporsi terhadap keseluruhan data frame
(df['A'] < 5).mean()

0.7

### 56. Mengeluarkan kolom dari Data Frame dengan `pop()`

In [ ]:
# data = {'nama': ['bayu', 'indra', 'devi', 'agni'],
#         'jenis_kelamin': ['L', 'L', 'P', 'L'],
#         'usia': [23, 21, 22, 25]}

data = pd.read_csv('data_peserta.csv')
df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

In [25]:
usia = df.pop('usia').to_frame()

In [26]:
df

    nama jenis_kelamin
0   bayu             L
1  indra             L
2   devi             P
3   agni             L

In [27]:
usia

   usia
0    23
1    21
2    22
3    25